Revit 2027 API
MEPSection.GetSegmentLength Method
 Get the length for the specified segment id in this section.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetSegmentLength(
	ElementId segmentId
)
Public Function GetSegmentLength (
	segmentId As ElementId
) As Double
public:
double GetSegmentLength(
	ElementId^ segmentId
)
member GetSegmentLength :
        segmentId : ElementId -> float
Parameters
segmentId ElementId
 The element id which can be duct segment and pipe segment.
Return Value
Double
Exceptions
Exception | Condition
ArgumentException |  The ElementId segmentId does not correspond to a valid section segment member.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MEPSection Class
Autodesk.Revit.DB.Mechanical Namespace